PyDevices/displayif/ports/esp32/mod_dotclockframebuffer.c
// SPDX-License-Identifier: MIT
// Dot-clock RGB framebuffer for esp32 port (ESP-IDF esp_lcd RGB panel).
//
// Python: displayif.DotClockFramebuffer (module name "displayif").
// CircuitPython equivalent: dotclockframebuffer.DotClockFramebuffer — same
// continuous DMA scanout + bounce, but MP presents via double panel FBs
// (paint back, swap on refresh) because LVGL blits directly into the FB;
// CP paints a separate Bitmap and FramebufferDisplay composites.
//
// Buffer typecode 'B', native blit/fill_rect. Reference: Qualia S3 + TL040HDS20.
// Lifecycle: idempotent deinit/__del__/ctor + soft-reset teardown
// (see include/displayif/soft_reset.h, IDEMPOTENT_LIFECYCLE.md,
// SOFT_RESET_AND_BRINGUP.md).

#include <string.h>
#include <stdlib.h>

#include "py/runtime.h"
#include "py/obj.h"
#include "py/binary.h"
#include "py/mpprint.h"
#include "displayif/mp_helpers.h"
#include "displayif/soft_reset.h"

#define DCFB_MAX_DATA_PINS 18
#define DCFB_NUM_FBS 2
#define DCFB_PRESENT_TIMEOUT_US 100000

#if defined(ESP_PLATFORM)
#include "esp_heap_caps.h"
#include "esp_err.h"
#include "esp_timer.h"
#include "soc/soc_caps.h"
#if SOC_LCD_RGB_SUPPORTED
#include "esp_lcd_panel_ops.h"
#include "esp_lcd_panel_rgb.h"
#include "esp_cache.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#endif
#endif

#include "displayif_esp32_pins.h"

typedef struct _dotclockframebuffer_obj_t {
    mp_obj_base_t base;
    uint16_t width;
    uint16_t height;
    uint16_t row_stride;
    uint8_t *buf;
    size_t buf_len;
    bool buf_owned; // true if we malloc'd buf; false if owned by esp_lcd panel
    int de_pin;
    int vsync_pin;
    int hsync_pin;
    int dclk_pin;
    int data_pins[DCFB_MAX_DATA_PINS];
    size_t data_pin_count;
    uint32_t frequency;
    uint16_t hsync_pulse_width;
    uint16_t hsync_front_porch;
    uint16_t hsync_back_porch;
    uint16_t vsync_pulse_width;
    uint16_t vsync_front_porch;
    uint16_t vsync_back_porch;
    bool hsync_idle_low;
    bool vsync_idle_low;
    bool de_idle_high;
    bool pclk_active_high;
    bool pclk_idle_high;
    int overscan_left;
    uint8_t bits_per_pixel;
    bool rgb666_layout;
    bool deinited;
#if defined(ESP_PLATFORM) && SOC_LCD_RGB_SUPPORTED
    esp_lcd_panel_handle_t panel;
    bool panel_ready;
    // Bounce DRAM refill memcpy's the PSRAM FB through the CPU cache. Explicit
    // esp_cache_msync on every blit contends on SPI0 with that ISR and causes
    // faint flicker (IDF draw_bitmap also skips FB msync when bb_size != 0).
    bool bounce_enabled;
    // Tear-free present: blit into fbs[draw_index]; refresh() promotes it and
    // switches draw to the other panel FB after bounce adopts the new front.
    uint8_t *fbs[DCFB_NUM_FBS];
    uint8_t draw_index;
    uint8_t num_fbs;
#endif
} dotclockframebuffer_obj_t;

#if defined(ESP_PLATFORM) && SOC_LCD_RGB_SUPPORTED
typedef struct {
    esp_lcd_panel_handle_t panel;
    bool panel_ready;
} dcfb_host_t;

static dcfb_host_t s_host;
#endif
static bool s_soft_reset_registered;

static const mp_obj_type_t dotclockframebuffer_type;

#if defined(ESP_PLATFORM)
static uint8_t *dotclockframebuffer_alloc(size_t nbytes) {
    uint8_t *ptr = heap_caps_malloc(nbytes, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    if (ptr == NULL) {
        mp_printf(&mp_plat_print,
            "displayif: SPIRAM alloc failed (%u bytes); trying internal heap. "
            "Enable CONFIG_SPIRAM and size PSRAM in sdkconfig for large RGB panels.\n",
            (unsigned)nbytes);
        ptr = heap_caps_malloc(nbytes, MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
    }
    return ptr;
}

static void dotclockframebuffer_free(uint8_t *ptr) {
    if (ptr != NULL) {
        heap_caps_free(ptr);
    }
}
#else
static uint8_t *dotclockframebuffer_alloc(size_t nbytes) {
    return malloc(nbytes);
}

static void dotclockframebuffer_free(uint8_t *ptr) {
    free(ptr);
}
#endif

#if defined(ESP_PLATFORM) && SOC_LCD_RGB_SUPPORTED
static void dcfb_host_teardown(void) {
    if (s_host.panel_ready && s_host.panel != NULL) {
        esp_lcd_panel_del(s_host.panel);
        s_host.panel = NULL;
        s_host.panel_ready = false;
    }
}

static void dcfb_ensure_soft_reset_registered(void) {
    if (!s_soft_reset_registered) {
        displayif_register_soft_reset(dcfb_host_teardown);
        s_soft_reset_registered = true;
    }
}

static void dotclockframebuffer_raise_esp_err(esp_err_t err) {
    if (err == ESP_OK) {
        return;
    }
    mp_raise_msg_varg(&mp_type_OSError, MP_ERROR_TEXT("ESP-IDF error %d (%s)"), err, esp_err_to_name(err));
}

// Match CircuitPython DotClockFramebuffer: RGB565 wire order is B0..B4, G0..G5, R0..R4.
static void dotclockframebuffer_fill_data_pins(dotclockframebuffer_obj_t *self, mp_obj_t red, mp_obj_t green, mp_obj_t blue, mp_obj_t data) {
    int pins[DCFB_MAX_DATA_PINS];
    size_t count = 0;

    if (data != MP_OBJ_NULL) {
        count = displayif_esp32_pin_seq_to_gpios(data, pins, DCFB_MAX_DATA_PINS);
    } else {
        size_t n_blue = displayif_esp32_pin_seq_to_gpios(blue, pins, DCFB_MAX_DATA_PINS);
        size_t n_green = displayif_esp32_pin_seq_to_gpios(green, pins + n_blue, DCFB_MAX_DATA_PINS - n_blue);
        size_t n_red = displayif_esp32_pin_seq_to_gpios(red, pins + n_blue + n_green,
            DCFB_MAX_DATA_PINS - n_blue - n_green);
        count = n_blue + n_green + n_red;
        if (!(n_red == 5 && n_green == 6 && n_blue == 5)) {
            mp_raise_ValueError(MP_ERROR_TEXT("red/green/blue must be 5/6/5 pins (RGB565)"));
        }
    }

    if (count == 0 || count > DCFB_MAX_DATA_PINS) {
        mp_raise_ValueError(MP_ERROR_TEXT("invalid RGB data pin layout"));
    }

    self->data_pin_count = count;
    for (size_t i = 0; i < DCFB_MAX_DATA_PINS; i++) {
        self->data_pins[i] = (i < count) ? pins[i] : -1;
    }
}

#define DCFB_CACHE_LINE 128

// Incremented in bounce EOF ISR when a whole FB has been sent to LCD DMA.
// Used by refresh() to wait until the newly promoted front is safe to leave.
static volatile uint32_t s_dcfb_frame_count;

static bool IRAM_ATTR dcfb_on_frame_buf_complete(esp_lcd_panel_handle_t panel,
    const esp_lcd_rgb_panel_event_data_t *edata, void *user_ctx) {
    (void)panel;
    (void)edata;
    (void)user_ctx;
    s_dcfb_frame_count++;
    return false;
}

// Sync dirty rows for DMA that reads PSRAM behind the cache (no bounce).
// With bounce buffers, refill uses CPU memcpy through DCache — skip msync.
static void dotclockframebuffer_msync_rows(dotclockframebuffer_obj_t *self, int y, int h) {
    if (self->buf == NULL || h <= 0 || self->bounce_enabled) {
        return;
    }
    size_t start = (size_t)y * self->row_stride;
    size_t end = start + (size_t)h * self->row_stride;
    size_t align_mask = (size_t)DCFB_CACHE_LINE - 1;
    size_t synced = start & ~align_mask;
    size_t sync_end = (end + align_mask) & ~align_mask;
    if (sync_end > self->buf_len) {
        sync_end = (self->buf_len + align_mask) & ~align_mask;
    }
    if (sync_end > synced) {
        dotclockframebuffer_raise_esp_err(
            esp_cache_msync(self->buf + synced, sync_end - synced, ESP_CACHE_MSYNC_FLAG_DIR_C2M));
    }
}

// Continuous RGB scanout of the panel's own PSRAM FBs (Qualia path + tear-free present).
static void dotclockframebuffer_init_panel(dotclockframebuffer_obj_t *self) {
    if (self->panel_ready) {
        return;
    }

    // Round h_res up to a multiple of 16 (same as CircuitPython DotClockFramebuffer).
    uint32_t h_res = (uint32_t)((self->width + self->overscan_left + 15) / 16 * 16);

    esp_lcd_rgb_panel_config_t panel_config = {
        .clk_src = LCD_CLK_SRC_DEFAULT,
        .data_width = 16,
        .bits_per_pixel = 16,
        // Two panel FBs: blit into the back; refresh() promotes and waits for
        // bounce to adopt it so LVGL never paints the live scanout buffer.
        .num_fbs = DCFB_NUM_FBS,
        // PSRAM cannot sustain 16bpp@720x720 DPI alone — bounce through DRAM
        // (ESP-IDF rgb_panel example / Qualia-class panels). Without this the
        // image walks/tears horizontally under load. When bounce is on, do not
        // esp_cache_msync the FB from blit (see bounce_enabled).
        .bounce_buffer_size_px = 20 * h_res,
        .dma_burst_size = 64,
        .hsync_gpio_num = self->hsync_pin,
        .vsync_gpio_num = self->vsync_pin,
        .de_gpio_num = self->de_pin,
        .pclk_gpio_num = self->dclk_pin,
        .disp_gpio_num = -1,
        .timings = {
            .pclk_hz = self->frequency,
            .h_res = h_res,
            .v_res = self->height,
            .hsync_pulse_width = self->hsync_pulse_width,
            .hsync_front_porch = self->hsync_front_porch,
            .hsync_back_porch = self->hsync_back_porch,
            .vsync_pulse_width = self->vsync_pulse_width,
            .vsync_front_porch = self->vsync_front_porch,
            .vsync_back_porch = self->vsync_back_porch,
            .flags = {
                .hsync_idle_low = self->hsync_idle_low,
                // Match CircuitPython DotClockFramebuffer (uses hsync idle for both).
                .vsync_idle_low = self->hsync_idle_low,
                .de_idle_high = self->de_idle_high,
                .pclk_active_neg = !self->pclk_active_high,
                .pclk_idle_high = self->pclk_idle_high,
            },
        },
        .flags = {
            // Continuous DMA scanout — required for TTL RGB panels (Qualia).
            .refresh_on_demand = 0,
            .fb_in_psram = 1,
        },
    };

    memcpy(panel_config.data_gpio_nums, self->data_pins, sizeof(int) * SOC_LCDCAM_RGB_DATA_WIDTH);

    esp_lcd_panel_handle_t panel = NULL;
    dotclockframebuffer_raise_esp_err(esp_lcd_new_rgb_panel(&panel_config, &panel));
    dotclockframebuffer_raise_esp_err(esp_lcd_panel_reset(panel));
    dotclockframebuffer_raise_esp_err(esp_lcd_panel_init(panel));

